<?php

if (!defined('BASEPATH'))
    exit('No direct script access allowed');

class Err {
    public static $arErrCode = array(
        //以下为服务端错误码 
        '0000' => '操作成功',
        '1001' => '签名认证不通过',
        '1002' => '服务器异常',
        '1003' => '您的输入有误', // 参数错误
        '1004' => '操作文件失败',
        '1005' => '没有更多内容啦', // 没有可操作的数据
        '1006' => '令牌认证失败，请重新登录',
        '1007' => '令牌已过期，请重新登录',
        '1008' => 'mc异常',
        '1009' => 'token参数不能为空，请先登录',
        '1099' => '未知错误',
        
        // 用户信息错误
        '1101'=> '未查询到应用数据',
        '1102'=> '昵称不能为空',
        '1103'=> '未查询到用户数据',
        '1111'=> '手机号格式不正确，请填写正确的手机号',
        '1112'=> '很抱歉，您今天的验证次数已达上限', // 很抱歉，同一IP每天对同一手机号码触发验证短信不超过3条
        '1113'=> '很抱歉，您今天的验证次数已达上限', // 很抱歉，同一IP每天最多只能对3个不同手机号码进行触发验证码
        '1114'=> '很抱歉，您今天的验证次数已达上限', // 很抱歉，每天对同一手机号码触发验证短信不超过5条
        '1115'=> '很抱歉，您的手机号码短消息发送过快，请稍候重试。',
        '1116'=> '获取验证码太过频繁，请在%s秒后重试',
        '1117'=> '短信发送失败',
        '1201'=> '手机号不能为空',
        '1202'=> '您输入的密码格式不正确，请输入6～15位的密码',
        '1203'=> '昵称格式不正确，长度为2～10位',
        "1204"=> '验证码不能为空',
        '1205'=> '手机验证码已失效',
        '1206'=> '手机验证码验证失败',
        '1207'=> '该手机号已注册，请重新输入手机号',
        '1208'=> '账号名或密码不正确，请重新登录', // 账号名或密码不正确。请重新登录
        '1209'=> '渠道（channel）不正确',
        '1210'=> '操作系统参数错误',

        '1211'=> '插入用户信息失败',
        '1212'=> '记录用户登录设备失败',
        '1213'=> '记录用户登录日志失败',
        '1214'=> '昵称重复，请重新填写',
        '1215'=> '用户信息修改失败',
        '1216'=> '只有手机注册账户才有此功能',
        '1217'=> '该账号不存在',
        '1218'=> '2次密码输入不一致',
        '1219'=> '密码修改失败',
    
        '1301'=> '请填写50字以内的反馈内容', // 反馈内容不能为空，且最多50个字
        '1302'=> '反馈信息提交失败',
        '1401'=> '金币变更记录历史失败',
        '1402'=> '积分变更记录历史失败',
        
        '1501'=> '用户注册时，APP来源获取失败',
        '1502'=> '用户信息已绑定手机号，不能修改手机号',
        '1503'=> '登录方式错误',
        
        // 游戏信息错误
        '2000' => '制作游戏删除失败',
        '2001' => '您提交的购买价格与商品实际价格不符',
        '2002' => '您的金币不足，完成任务获得更多金币。', // 您的余额不足，不能购买该游戏
        '2003' => '该游戏已下架', // 该游戏不存在或已下架
        '2004' => '游戏购买失败',
        '2005' => '游戏购买次数次数更新失败',
        '2006' => '扣除余额失败',
        '2007' => '游戏制作失败',
        
    
        '2008' => '您已经分享过该游戏了',
        '2009' => '该游戏已被下架', //该游戏不存在或已下架
        '2010' => '游戏分享次数更新失败',
        '2011' => '游戏分享记录失败',
        '2012' => '游戏获取失败',
        '2013' => '游戏已经下载过了',
        '2014' => '该游戏已被下架啦', // 该游戏不存在
    
        '2015'=> '您输入的内容过长，请重新输入。', // 评论内容太长，请重新输入
        '2016'=> '评分只能1～5分',
        '2017'=> '该游戏不能进行评论评分',
        '2018'=> '游戏评论失败，请稍后再试。', // 评论失败
        '2019'=> '修改最高评分失败',
        '2020'=> '获取评论列表失败',
        '2021'=> '获取评论总条数失败',
        '2022'=> '修改游戏综合评分失败',
    
        '2023'=> '该游戏已被下架', // 该游戏不存在或下架
        '2024'=> '该游戏已收藏',
        '2025'=> '加入收藏失败，请稍后再试。', // 加入收藏失败
        '2026'=> '取消收藏失败，请稍后再试。', // 取消收藏失败
        '2027' => '游戏信息更新失败', // 游戏信息更新失败
        
        '2041' => '用户信息修改失败',
        '2042' => '文件上传失败',
        '2043' => '您的积分不足，请完成任务获得更多积分。', // 积分不足
        '2044' => 'FTP连接失败',
        
        '2045' => '游戏得分修改失败',
        '2046' => '图片格式不正确',
        '2047' => '图片不能为空',
        '2048' => '制作图片修改失败',
        '2049' => '你还没玩过这个游戏',
        
        '2060' => '游戏得分保存失败',
        '2061' => '游戏最高得分不能为0',
        '2062' => '开发商游戏玩过统计失败',
        
        '2081' => '获取白鹭游戏支付回调地址失败',
        '2082' => '白鹭支付订单已过期',
        
        //搜索模块 3001-----3099
        '3001' => '搜索关键字不能为空',
        '3002' => '您搜索的内容没有结果，请更换词汇后再试。', // 没有查询到数据
        '3005' => '没有关键字排行数据',
    
        //活动模块 4001-----4099
        '4001'=> '获取活动列表失败',
        '4002'=> '获取活动总条数失败',
        '4003'=> '获取banner列表失败',
        '4004'=> '获取banner总条数失败',
        '4005'=> '没有查询到详情数据',
    
        //统计等api模块 5001-----5099
        '5001' => '统计分享被玩PV失败',
        '5002' => '统计制作游戏分享被打开PV，被玩pv失败',
        '5003' => '统计游戏分享被打开PV，被玩pv失败',
        '5004' => '分享内容不存在',
        '5005' => '未获取到用户上传照片及游戏名',
        
        // 上传数据 6000-6099
        '6000' => '服务器没有找到该游戏，请先上传游戏',
        
        //任务上领取积分和金币----6100-6199
        '6100' => '暂时没有奖励可以领取，请完成任务领取奖励。', // 没有金币或积分可领取
        '6101' => '没有找到需要完成的任务',
        '6102' => '奖励领取失败，请稍后再试。', // 奖励领取失败
        '6103' => '您已经领取过该任务的奖励',
        '6104' => '您没有完成该任务',
        '6105' => '免费游戏任务获取失败',
        '6106' => '购买金币游戏任务获取失败',
        '6107' => '下载金币游戏任务获取失败',
        '6108' => '制作游戏任务获取失败',
        '6109' => '首次分享任务获取失败',
        '6110' => '首次评论任务获取失败',
        '6111' => '制作被打开的次数任务获取失败',
        '6112' => '完善信息任务获取失败',
        '6113' => '突破记录任务获取失败',
        
        '6201' => '没有找到这个任务', // 该任务不存在
        '6202' => '插入任务完成记录失败',
        '6203' => 'APP评论地址获取失败',
        
        //消息推送 7001-7099
        '7001'=> '插入消息推送任务记录失败',
        '7002'=> '插入消息推送记录失败',
        
        // 信箱 8001 - 8099
        '8001'=> '信箱状态更新失败',
        '8002'=>'未读邮件无法删除', // 信箱未读，删除失败
        '8003'=> '信箱删除失败',
        
        // 非法字符
        '9001'=> '包含非法字符',
        
        // 商城 2101 --- 2199 
        '2101' => '微信支付，通信失败',
        '2102' => '商品订单生成失败',
        '2103' => '商品订单更新失败',
        '2104' => '微信预下订单失败',
        '2105' => '记录用户充值失败',
        '2106' => '暂时没有充值包数据',
        '2107' => '支付宝支付失败',
        
        // 社交 2201 --- 2299
        '2201' => '好友添加失败',
        '2202' => '通讯录好友记录失败',
        '2203' => '改好友已不存在',
        
        // 其他 2301 --- 2399
        '2301' => '获取游客状态失败',
        
        // 开发商接入游戏
        '2401' => '接入游戏时，未配置汇率',
        '2402' => '预购买道具，订单生成失败',
        '2403' =>  '获取购买道具信息失败',
        '2404' => '道具购买失败',
        '2405' => '游戏接入号错误',
        '2406' => '渠道商信息获取失败',
        '2407' => '游戏测试链接失效，刷新链接重新获取',
        '2408' => '开发者上传游戏不存在',
        '2409' => '开发者资质信息获取失败',
        '2410' => 'developer_id参数错误',
    );
}
